willie68/ArduinoTPS_Boards/ArduinoSPS/avr/boards.txt
TinySPS.name=TinySPS
TinySPS.bootloader.tool=arduino:avrdude
TinySPS.bootloader.unlock_bits=0xff
TinySPS.bootloader.lock_bits=0xff
TinySPS.bootloader.low_fuses=0xfe
TinySPS.bootloader.high_fuses=0xdf
TinySPS.bootloader.extended_fuses=0xff

TinySPS.build.core=arduino:arduino
TinySPS.build.board=TinySPS
TinySPS.build.mcu=attiny84
TinySPS.build.variant=TinySPS
TinySPS.build.f_cpu=8000000L

TinySPS.upload.tool=arduino:avrdude
TinySPS.upload.maximum_size=8192

ArduinoSPS.name=ArduinoSPS
ArduinoSPS.bootloader.tool=arduino:avrdude
ArduinoSPS.bootloader.low_fuses=0xFF
ArduinoSPS.bootloader.unlock_bits=0x3F
ArduinoSPS.bootloader.lock_bits=0x0F
ArduinoSPS.bootloader.high_fuses=0xDA
ArduinoSPS.bootloader.extended_fuses=0xFD

ArduinoSPS.build.board=ArduinoSPS
ArduinoSPS.build.mcu=atmega328p
ArduinoSPS.build.f_cpu=16000000L
ArduinoSPS.build.core=arduino:arduino
ArduinoSPS.build.variant=ArduinoSPS

ArduinoSPS.upload.tool=arduino:avrdude
ArduinoSPS.upload.maximum_size=30720
ArduinoSPS.upload.maximum_data_size=2048
ArduinoSPS.upload.speed=57600
